Tekla Open API Reference for Tekla Structures 2025
Double.ToString Method
 Returns the string representation of the object.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The string representation of the object.
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace